In [ ]:
import mysql.connector as mysql
from mysql.connector import Error
import pandas as pd
import numpy as np

In [ ]:
dataset = pd.read_csv("Airplane_Crashes_and_Fatalities_Since_1908.csv")

In [ ]:
db_name='airplane_crashes'
try:
    mydb = mysql.connect(host='localhost', user='root', password='franci22') # you can add the auth_plugin here too (ref line 26)
    if mydb.is_connected():
        mycursor = mydb.cursor()
        mycursor.execute('SHOW DATABASES')
        result = mycursor.fetchall()
        print(result)
        for x in result:
            if db_name == x[0]:
                mycursor.execute('DROP DATABASE ' + db_name) # delete old database
                mydb.commit() # make the changes official
                print("The database already exists! The old database has been deleted!)")

        mycursor.execute("CREATE DATABASE "+ db_name)
        print("Database is created")
except Error as e:
    print("Error while connecting to MySQL", e)

[('airplane_crashes',), ('electronics',), ('example_database',), ('GoShare',), ('information_schema',), ('mid_practice',), ('movies',), ('mysql',), ('parents',), ('performance_schema',), ('sys',)]
The database already exists! The old database has been deleted!)
Database is created

In [ ]:
mycursor.execute('USE' + ' ' + db_name)

In [ ]:
#create tables
mycursor.execute(
      '''
        CREATE TABLE `Airplane` (
          `serial_number` varchar(100),
          `registration` varchar(100),
          `operator` varchar(100),
          `type` varchar(100),
          PRIMARY KEY (serial_number, registration)
        );
      '''
      )

In [ ]:
mycursor.execute(
      '''
        CREATE TABLE Flight (
           flight_number varchar(100),
           aboard int,
           route varchar(100),
           serial_number varchar(100),
           registration varchar(100),
           PRIMARY KEY (flight_number),
           FOREIGN KEY (`serial_number`, `registration`) REFERENCES `Airplane` (`serial_number`, `registration`)
        );
      '''
      )

In [ ]:
mycursor.execute(
    '''
        CREATE TABLE `Crash` (
          `index` int,
          `date` date,
          `time` time,
          `location` varchar(100),
          `summary` varchar(2000),
          `serial_number` varchar(100),
          `registration` varchar(100),
          PRIMARY KEY (`index`),
          FOREIGN KEY (`serial_number`, `registration`) REFERENCES `Airplane`(`serial_number`, `registration`)
        );
    '''
)

In [ ]:
mycursor.execute(
    '''
    CREATE TABLE `Fatalities` (
    `crash_index` int,
    `number_of_fatalities` FLOAT,
    `ground` FLOAT,
    PRIMARY KEY (`crash_index`),
    FOREIGN KEY (`crash_index`) REFERENCES `Crash`(`index`)
);
    '''
)

In [ ]:
selection = dataset.iloc[3196:] #take values from 1980-90 and take all columns except from the first
null_val = selection.isnull().sum()
selection = selection.drop(labels='Flight #', axis=1)
selection.head()

,index,Date,Time,Location,Operator,Route,Type,Registration,cn/In,Aboard,Fatalities,Ground,Summary
3196,3196,01/02/1980,NaN,Haiti,Haïti Air Inter,Port au Prince - Cape Haitien,Britten Norman BN Islander,HH-CNC,474,9.0,9.0,0.0,Struck high ground in poor visibility while en...
3197,3197,01/11/1980,01:23,Over the AtlantiOcean,Private charter,Shreveport - Baton Rouge,Cessna 441 Conquest,N442NC,NaN,2.0,2.0,0.0,The plane was on a 45 minute fight from Shreve...
3198,3198,01/21/1980,19:10,"Elburz Mtns., near Laskarak, Markazi, Iran",Iran National Airlines,Babol Sar - Tehran,Boeing B-727-86,EP-IRD,19817/537,128.0,128.0,0.0,The aircraft crashed into a mountain during a ...
3199,3199,01/23/1980,NaN,"Mt. Cemonyet, Indonesia",Pelita Air Service,NaN,CASA 212 Aviocar 100,PK-PCX,45/3N,13.0,13.0,0.0,"Hit high ground at 2,700 ft. in poor weather w..."
3200,3200,01/24/1980,06:20,"Near Mandalay, Burma",Military - Union of Burma Air Force,Mandalay - Rangoon,Fairchild FH-227H,5003,545,44.0,43.0,0.0,Crashed into a building while attempting an em...

In [ ]:
import random

#FLIGHT NUMBER
flight_number = []

while len(flight_number) != 2072:
    n = random.randint(1000, 10000)
    if n not in flight_number:
        flight_number.append(n)


selection.insert(6, 'Flight#', flight_number)

#SERIAL NUMBER
serial_num = selection.loc[3196:, 'cn/In']
serial_num_ = list(serial_num)
selection = selection.drop(labels='cn/In', axis=1)

for x in range(len(serial_num_)):
    n = random.randint(100, 8000)
    if serial_num_[x] is np.nan:
        while n in serial_num:
            n = random.randint(100, 8000)
        serial_num_[x] = str(n)

selection.insert(9, 'Serial#', serial_num_)


#REGISTRATION

registration = selection.loc[3196:, 'Registration']
registration_ = list(registration)
selection = selection.drop(labels='Registration', axis=1)

import string
for r in range(len(registration_)):
    reg1 = ''.join(random.choice(string.ascii_uppercase) for x in range(2))
    reg2 = ''.join(random.choice(string.ascii_uppercase) for x in range(3))
    reg = reg1+'-'+reg2
    if reg not in registration_:
        registration_[r] = reg

selection.insert(8, 'Registration', registration_)

'''
null_val = selection.isnull().sum()
#print(selection)
#print('null values are:')
print(null_val)
'''

#TIME
import datetime
from datetime import datetime

times = selection['Time'].tolist()
t2 = []
for t in times:
    if type(t) != str:
            t2.append(0)
    else:
        allowed_characters = ['0','1','2','3','4','5','6','7','8','9',':']
        for i in t:
            if i not in allowed_characters or (i == ':' in (t[0] or t[-1])):
                t = t.replace(i,'')
        if ':' not in t:
            t = t[:len(t)//2]+':'+t[len(t)//2:]
        p = t.partition(':')
        if len(p[0]) > 2:
            t = t[1:]
        if len(p[2]) > 2:
            t = t[:-1]
        try:
            time = datetime.strptime(t, '%H:%M').time()
            t2.append(time)
        except:
            t2.append(0)
            continue
selection = selection.drop(labels='Time', axis=1)
selection.insert(2, 'Time', t2)


#DATE

date = selection.loc[3196:, 'Date']
date_ = list(date)
list = [datetime.strptime(x,'%m/%d/%Y').strftime('%Y/%m/%d') for x in date_]
#print(list)
selection = selection.drop(labels='Date', axis=1)
selection.insert(1, 'Date', list)


#Fatalities

In [ ]:
datairplane = selection[['Serial#', 'Registration', 'Operator', 'Type']]

In [ ]:
#selection.head(2000)

,index,Date,Time,Location,Operator,Route,Flight#,Type,Registration,Serial#,Aboard,Fatalities,Ground,Summary
3196,3196,1980/01/02,0,Haiti,Haïti Air Inter,Port au Prince - Cape Haitien,6218,Britten Norman BN Islander,TV-YEY,474,9.0,9.0,0.0,Struck high ground in poor visibility while en...
3197,3197,1980/01/11,01:23:00,Over the AtlantiOcean,Private charter,Shreveport - Baton Rouge,6083,Cessna 441 Conquest,UP-XWZ,7167,2.0,2.0,0.0,The plane was on a 45 minute fight from Shreve...
3198,3198,1980/01/21,19:10:00,"Elburz Mtns., near Laskarak, Markazi, Iran",Iran National Airlines,Babol Sar - Tehran,2898,Boeing B-727-86,RF-LTZ,19817/537,128.0,128.0,0.0,The aircraft crashed into a mountain during a ...
3199,3199,1980/01/23,0,"Mt. Cemonyet, Indonesia",Pelita Air Service,NaN,2719,CASA 212 Aviocar 100,DI-NXZ,45/3N,13.0,13.0,0.0,"Hit high ground at 2,700 ft. in poor weather w..."
3200,3200,1980/01/24,06:20:00,"Near Mandalay, Burma",Military - Union of Burma Air Force,Mandalay - Rangoon,5580,Fairchild FH-227H,RY-BCV,545,44.0,43.0,0.0,Crashed into a building while attempting an em...
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
5191,5191,2008/02/26,16:16:00,"Off Macae , Rio de Janeiro , Brazil",BHS - Brazilian Helicopter Service Air Taxi,Oil Rig P18 - Macae,9017,Eurocopter AS332L2 Super Puma,JC-SVX,2570,20.0,5.0,0.0,Less than half minute after the taking-off fro...
5192,5192,2008/03/03,16:00:00,"Near Bethani, Nepal",United Nations Mission,NaN,2548,Mi-17,EZ-PYT,2144,10.0,10.0,0.0,"The helicopter, carrying United Nations person..."
5193,5193,2008/03/15,08:15:00,"Nbagu, Nigeria",Trade Wings Aviation Ltd.,Lagos - Bebi Air Strip,6274,Beechcraft 1900D,ZU-AUN,UE-322,3.0,3.0,0.0,The plane crashed while en route. Wreckage was...
5194,5194,2008/04/03,11:00:00,"Lawa, Suriname",Blue Wing Airlines,Paramaribo - Lawa,5981,Antonov An-28,CT-UWC,1AJ007-17,19.0,19.0,0.0,While attempting to land the crew aborted the ...
5195,5195,2008/04/09,23:27:00,"Bundeena, Australia",Avtex Air Services,Sydney - Brisbane,2406,Swearingen SA227AC Metroliner III,OF-CEZ,AC-600,1.0,1.0,0.0,The pilot of the mail plane reported some mino...

In [ ]:
for i,row in datairplane.iterrows():
    sql = "INSERT INTO airplane_crashes.Airplane VALUES (%s,%s,%s,%s)"
    mycursor.execute(sql, tuple([row['Serial#'], row['Registration'], row['Operator'], row['Type']]))
    mydb.commit()

In [ ]:
#mycursor.execute("SELECT * FROM Airplane")
#result = mycursor.fetchall()
#print(result)

In [ ]:
dataflight = selection[['Flight#', 'Aboard', 'Route', 'Serial#', 'Registration']]

In [ ]:
for i, row in dataflight.iterrows():
    sql = "INSERT INTO airplane_crashes.Flight VALUES (%s,%s,%s,%s,%s)"
    mycursor.execute(sql, tuple([row['Flight#'], row['Aboard'], row['Route'], row['Serial#'], row['Registration']]))

    mydb.commit()

In [ ]:
datacrash = selection[['index', 'Date', 'Time', 'Location', 'Summary', 'Serial#', 'Registration']]

In [ ]:
for i, row in datacrash.iterrows():
    sql = "INSERT INTO airplane_crashes.Crash VALUES (%s,%s,%s,%s,%s,%s,%s)"
    mycursor.execute(sql, tuple([row['index'], row['Date'], row['Time'], row['Location'],  row['Summary'], row['Serial#'], row['Registration']]))

    mydb.commit()

In [ ]:
datafatalities = selection[['index', 'Fatalities', 'Ground']]
for i, row in datafatalities.iterrows():
    sql = "INSERT INTO airplane_crashes.Flight VALUES (%s,%s,%s)"
    mycursor.execute(sql, tuple([ row['index'], int(row['Fatalities']), int(row['Ground'])]))

    mydb.commit()

ProgrammingError: Failed processing format-parameters; Python 'float64' cannot be converted to a MySQL type